Revit 2027 API
DWGImportOptions.SetLineWeights Method
 Set array of line weights.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLineWeights(
	IList<int> lineWeight
)
Public Sub SetLineWeights (
	lineWeight As IList(Of Integer)
)
public:
void SetLineWeights(
	IList<int>^ lineWeight
)
member SetLineWeights :
        lineWeight : IList<int> -> unit
Parameters
lineWeight IList<Int32>
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DWGImportOptions Class
Autodesk.Revit.DB Namespace